s1 = {1: 4, 4: 6, 9: 2}
s2 = [1, 8, 3, 4, 8, 1, 9, 5]
kys = list(s1.items())
print(kys)
for i in s2:
    for x in kys:
        for v in kys[x]:
            if i == v[0]:
                i = v[1]
    print(s2)
#Задан словарь со значениями 1:4, 4:6, 9:2 (ключи тоже числа). Так же задан список чисел [1, 8, 3, 4, 8, 1, 9, 5]. Замените в этом списке значения используя заданный словарь, таким образом: если число есть среди ключей, то замените на соответствующее, иначе оставьте как есть. Найдите сумму значений списка после изменений и выведи список и сумму.






